Repository: QUMCTraining/Laboratory
Catalog: LaboratoryProject/Resources/SharedResource.*.resx
Languages: ar

source: BirthDate
ar: تاريخ الميلاد

source: Blood resulted within 14 working days, kindly bring the approved university/institution tests' form to be filled out
ar: خروج نتيجة تحليل الدم خلال 14 يوم عمل ، يرجى إحضار استمارة الاختبارات الجامعية / المؤسسة المعتمدة لتعبئته

source: College
ar: الكلية

source: CopyOfStudentId
ar: صورة من بطاقة الطالب

source: Email
ar: البريد الإلكتروني

source: FamilyNameArabic
ar: إسم العائلة | عربي

source: FamilyNameEnglish
ar: إسم العائلة | انجليزي

source: FatherNameArabic
ar: إسم الأب | عربي

source: FatherNameEnglish
ar: إسم الأب | انجليزي

source: FirstNameArabic
ar: الأسم الأول | عربي

source: FirstNameEnglish
ar: الأسم الأول | انجليزي

source: GrandFatherNameArabic
ar: إسم الجد | عربي

source: GrandFatherNameEnglish
ar: إسم الجد | انجليزي

source: I declare that the above-mentioned data is accurate and filled out by me personally
ar: أقر بأن البيانات المذكورة أعلاه صحيحة وتم ملؤها شخصيًا

source: Important Notes
ar: ملاحظات هامة

source: In case the student id is not available, please attach a copy of Qassim University student file
ar: في حالة بطاقة الطالب غير موجودة, الرجاء إدراج نسخة من ملف طالب جامعة القصيم.

source: Lab is open from 8:00 AM till 1:00 PM
ar: المختبر مفتوح من الساعة 8:00 صباحًا حتى الساعة 1:00 مساءً

source: MedicalFileNo
ar: رقم الملف الطبي

source: MessageSuccessfully
ar: تم إرسال رسالتك بنجاح. سوف نتصل بك قريبا!

source: NationalOrResidenceId
ar: رقم الهوية \ الإقامة

source: NationalOrResidenceIdFile
ar: صورة من بطاقة الهوية / الإقامة

source: PhoneNo
ar: رقم الجوال

source: qumc
ar: المدينة الطبية

source: Student Details
ar: تفاصيل الطالب

source: Students and Interns Screening Application Form
ar: استمارة طلب فحص الطلاب والمتدربين

source: Students that did not submit a request through the portal will not be accepted
ar: لن يتم قبول الطلاب الذين لم يقدموا طلبًا عبر البوابة

source: StudentsStatus
ar: حالة الطالب

source: submit
ar: تقديم

source: TestDate
ar: يوم الموعد

source: TextKindlySelectSuitableDate
ar: الرجاء إختيار تاريخ الموعد المناسب

source: ThanksToSubmit
ar: شكرًا لك!

source: UniversityNumber
ar: الرقم الجامعي
